taurus/test.yaml
settings:
  env:
    TAURUS_baseUrl: https://project-235906.appspot.com/
execution:
- concurrency: 10
  hold-for: 5m
  ramp-up: 2m
  scenario: yaml_example
  
scenarios:
  yaml_example:
    retrieve-resources: false
    requests:
      - ${TAURUS_baseUrl}/hello-world"
      - ${TAURUS_baseUrl}/hello-world-bean"

reporting:
- module: final-stats
- module: console

settings:
  check-interval: 5s
  default-executor: jmeter

provisioning: local

reporting:
- final-stats
- blazemeter